# FindAssociatedPlanViewId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Level..::..FindAssociatedPlanViewId Method
Level Class See Also
---
Finds the id of the first available associated floor or structural plan view associated with this level.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public ElementId FindAssociatedPlanViewId()
```

Visual Basic
---
```text
Public Function FindAssociatedPlanViewId As ElementId
```

Visual C++
---
```text
public:
ElementId^ FindAssociatedPlanViewId()
```

# Remarks
The view id returned is determined by the same rules associated with the Revit tool "Go to Floor Plan". Many levels may actually have more than one associated floor plan id and this routine will only return the first one found. If no associated view is found, InvalidElementId is returned.
# See Also
Level Class
Autodesk.Revit.DB Namespace